#+TITLE: Haskell Programming from First Principles Chapter 11 notes/answers
#+NAME: David Ressman
#+EMAIL: davidr@ressman.org
#+LANGUAGE: en
#+STARTUP: indent
#+OPTIONS: num:nil toc:1
#+PROPERTY: header-args:haskell :cache yes :results verbatim :exports both
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />

Chapter 11, Algebraic Data Types

*** 4
#+BEGIN_SRC haskell
import Data.Int
maxBound :: Int
#+END_SRC

#+RESULTS[7d5c290c7c049df66b98f5b17a02a940ce080b40]:
: 9223372036854775807

so ~Int~ looks to be 64 bit with cardinality of \~1.8e19

#+BEGIN_SRC haskell
import Data.Int
maxBound :: Integer
#+END_SRC

#+RESULTS[c93e9d878bdf0a25748a2dc12203a15cf16d25b9]:
: <interactive>:17:1: error:
:     • No instance for (Bounded Integer)
:         arising from a use of ‘maxBound’
:     • In the expression: maxBound :: Integer
:       In an equation for ‘it’: it = maxBound :: Integer

I'm guessing this means that Integer is an infinite set.

*** 1
#+BEGIN_SRC haskell
:t MakeExample
#+END_SRC

#+RESULTS[4105eaa7259112617b5029ca979892b870c29c5b]:
: MakeExample :: Example

#+BEGIN_SRC haskell
:t Example
#+END_SRC

#+RESULTS[1483403d966005a13fc08fa09ae9bc1f05db2645]:
: <interactive>:1:1: error:
:     • Data constructor not in scope: Example
:     • Perhaps you meant one of these:
:         ‘Example0’ (line 2), ‘Example1’ (line 5), ‘Example2’ (line 8)

Which seems reasonable since the type of a type constructor doesn't make sense

*** 2
#+BEGIN_SRC haskell
:info Example
#+END_SRC

#+RESULTS[45bad130f60b32db3653061c6e5c06e72b90c930]:
: data Example = MakeExample 	-- Defined at <interactive>:19:1
: instance [safe] Show Example -- Defined at <interactive>:19:37

we only have the ~Show~ instance defined

*** 3
#+BEGIN_SRC haskell
data Example' = MakeExample' Int deriving Show
:t MakeExample'
#+END_SRC

#+RESULTS[1393c73efd88e47692a558e32dfb1b53a47f9ff8]:
: MakeExample' :: Int -> Example'

We changed it from a nullary to a unary constructor

* 11.10 Sum types

Note that ~|~ or /OR/ is the sum function for algebraic datatypes, so to calculate the cardinality
of ~Bool~,

#+BEGIN_EXAMPLE
-- excuse the abuse of notation

card(True) + card(False)
1          + 1
2
#+END_EXAMPLE

To verify:

#+BEGIN_SRC haskell
length (enumFrom False)
#+END_SRC

#+RESULTS[8b2e4463db2a489a0d1857ce95a499d9e058ca5b]:
: 2

* 11.11 Product types

A product type's cardinality is the product of the cardinalities of its inhabitants. Where the
sum type was expressing /OR/, the product type expresses /AND/.

A product type is analogous to a C struct

/Records/ are product types with additional syntax to provide accessors to fields within

Compare:

#+BEGIN_SRC haskell
  data Person = MkPerson String Int deriving (Eq, Show)

  -- sample data
  jm = MkPerson "julie" 108
  ca = MkPerson "chris" 16

  namae :: Person -> String
  namae (MkPerson s _) = s
#+END_SRC

With:

#+BEGIN_SRC haskell
  data Person = Person {name :: String, age :: Int } deriving (Eq, Show)

  papu = Person "Papu" 5
  (name papu, age papu)
#+END_SRC

#+RESULTS[c2673d83803b9468d5bfa4960e857d898adacb7a]:
: Prelude> Prelude> ("Papu",5)

